espressif/esp-idf/components/soc/esp32p4/include/soc/lp_iomux_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: clk_en */
/** Type of clk_en register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lp_iomux_clk_en_reg_t;


/** Group: ver_date */
/** Type of ver_date register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ver_date : R/W; bitpos: [27:0]; default: 2294547;
         *  Reserved
         */
        uint32_t reg_ver_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_iomux_ver_date_reg_t;


/** Group: pad0 */
/** Type of pad0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad0_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad0_drv:2;
        /** reg_pad0_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad0_rde:1;
        /** reg_pad0_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad0_rue:1;
        /** reg_pad0_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad0_mux_sel:1;
        /** reg_pad0_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad0_fun_sel:2;
        /** reg_pad0_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad0_slp_sel:1;
        /** reg_pad0_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad0_slp_ie:1;
        /** reg_pad0_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad0_slp_oe:1;
        /** reg_pad0_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad0_fun_ie:1;
        /** reg_pad0_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad0_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad0_reg_t;


/** Group: pad1 */
/** Type of pad1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad1_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad1_drv:2;
        /** reg_pad1_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad1_rde:1;
        /** reg_pad1_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad1_rue:1;
        /** reg_pad1_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad1_mux_sel:1;
        /** reg_pad1_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad1_fun_sel:2;
        /** reg_pad1_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad1_slp_sel:1;
        /** reg_pad1_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad1_slp_ie:1;
        /** reg_pad1_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad1_slp_oe:1;
        /** reg_pad1_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad1_fun_ie:1;
        /** reg_pad1_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad1_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad1_reg_t;


/** Group: pad2 */
/** Type of pad2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad2_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad2_drv:2;
        /** reg_pad2_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad2_rde:1;
        /** reg_pad2_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad2_rue:1;
        /** reg_pad2_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad2_mux_sel:1;
        /** reg_pad2_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad2_fun_sel:2;
        /** reg_pad2_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad2_slp_sel:1;
        /** reg_pad2_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad2_slp_ie:1;
        /** reg_pad2_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad2_slp_oe:1;
        /** reg_pad2_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad2_fun_ie:1;
        /** reg_pad2_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad2_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad2_reg_t;


/** Group: pad3 */
/** Type of pad3 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad3_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad3_drv:2;
        /** reg_pad3_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad3_rde:1;
        /** reg_pad3_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad3_rue:1;
        /** reg_pad3_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad3_mux_sel:1;
        /** reg_pad3_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad3_fun_sel:2;
        /** reg_pad3_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad3_slp_sel:1;
        /** reg_pad3_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad3_slp_ie:1;
        /** reg_pad3_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad3_slp_oe:1;
        /** reg_pad3_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad3_fun_ie:1;
        /** reg_pad3_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad3_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad3_reg_t;


/** Group: pad4 */
/** Type of pad4 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad4_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad4_drv:2;
        /** reg_pad4_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad4_rde:1;
        /** reg_pad4_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad4_rue:1;
        /** reg_pad4_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad4_mux_sel:1;
        /** reg_pad4_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad4_fun_sel:2;
        /** reg_pad4_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad4_slp_sel:1;
        /** reg_pad4_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad4_slp_ie:1;
        /** reg_pad4_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad4_slp_oe:1;
        /** reg_pad4_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad4_fun_ie:1;
        /** reg_pad4_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad4_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad4_reg_t;


/** Group: pad5 */
/** Type of pad5 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad5_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad5_drv:2;
        /** reg_pad5_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad5_rde:1;
        /** reg_pad5_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad5_rue:1;
        /** reg_pad5_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad5_mux_sel:1;
        /** reg_pad5_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad5_fun_sel:2;
        /** reg_pad5_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad5_slp_sel:1;
        /** reg_pad5_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad5_slp_ie:1;
        /** reg_pad5_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad5_slp_oe:1;
        /** reg_pad5_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad5_fun_ie:1;
        /** reg_pad5_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad5_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad5_reg_t;


