espressif/esp-idf/components/soc/esp32p4/include/soc/lp_iomux_struct.h
/** Group: pad6 */
/** Type of pad6 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad6_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad6_drv:2;
        /** reg_pad6_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad6_rde:1;
        /** reg_pad6_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad6_rue:1;
        /** reg_pad6_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad6_mux_sel:1;
        /** reg_pad6_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad6_fun_sel:2;
        /** reg_pad6_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad6_slp_sel:1;
        /** reg_pad6_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad6_slp_ie:1;
        /** reg_pad6_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad6_slp_oe:1;
        /** reg_pad6_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad6_fun_ie:1;
        /** reg_pad6_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad6_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad6_reg_t;


/** Group: pad7 */
/** Type of pad7 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad7_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad7_drv:2;
        /** reg_pad7_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad7_rde:1;
        /** reg_pad7_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad7_rue:1;
        /** reg_pad7_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad7_mux_sel:1;
        /** reg_pad7_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad7_fun_sel:2;
        /** reg_pad7_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad7_slp_sel:1;
        /** reg_pad7_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad7_slp_ie:1;
        /** reg_pad7_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad7_slp_oe:1;
        /** reg_pad7_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad7_fun_ie:1;
        /** reg_pad7_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad7_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad7_reg_t;


/** Group: pad8 */
/** Type of pad8 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad8_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad8_drv:2;
        /** reg_pad8_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad8_rde:1;
        /** reg_pad8_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad8_rue:1;
        /** reg_pad8_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad8_mux_sel:1;
        /** reg_pad8_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad8_fun_sel:2;
        /** reg_pad8_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad8_slp_sel:1;
        /** reg_pad8_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad8_slp_ie:1;
        /** reg_pad8_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad8_slp_oe:1;
        /** reg_pad8_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad8_fun_ie:1;
        /** reg_pad8_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad8_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad8_reg_t;


/** Group: pad9 */
/** Type of pad9 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad9_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad9_drv:2;
        /** reg_pad9_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad9_rde:1;
        /** reg_pad9_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad9_rue:1;
        /** reg_pad9_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad9_mux_sel:1;
        /** reg_pad9_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad9_fun_sel:2;
        /** reg_pad9_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad9_slp_sel:1;
        /** reg_pad9_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad9_slp_ie:1;
        /** reg_pad9_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad9_slp_oe:1;
        /** reg_pad9_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad9_fun_ie:1;
        /** reg_pad9_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad9_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad9_reg_t;


/** Group: pad10 */
/** Type of pad10 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad10_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad10_drv:2;
        /** reg_pad10_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad10_rde:1;
        /** reg_pad10_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad10_rue:1;
        /** reg_pad10_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad10_mux_sel:1;
        /** reg_pad10_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad10_fun_sel:2;
        /** reg_pad10_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad10_slp_sel:1;
        /** reg_pad10_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad10_slp_ie:1;
        /** reg_pad10_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad10_slp_oe:1;
        /** reg_pad10_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad10_fun_ie:1;
        /** reg_pad10_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad10_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad10_reg_t;


/** Group: pad11 */
/** Type of pad11 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad11_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad11_drv:2;
        /** reg_pad11_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad11_rde:1;
        /** reg_pad11_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad11_rue:1;
        /** reg_pad11_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad11_mux_sel:1;
        /** reg_pad11_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad11_fun_sel:2;
        /** reg_pad11_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad11_slp_sel:1;
        /** reg_pad11_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad11_slp_ie:1;
        /** reg_pad11_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad11_slp_oe:1;
        /** reg_pad11_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad11_fun_ie:1;
        /** reg_pad11_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad11_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad11_reg_t;


/** Group: pad12 */
/** Type of pad120 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad12_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad12_drv:2;
        /** reg_pad12_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad12_rde:1;
        /** reg_pad12_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad12_rue:1;
        /** reg_pad12_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad12_mux_sel:1;
        /** reg_pad12_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad12_fun_sel:2;
        /** reg_pad12_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad12_slp_sel:1;
        /** reg_pad12_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad12_slp_ie:1;
        /** reg_pad12_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad12_slp_oe:1;
        /** reg_pad12_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad12_fun_ie:1;
        /** reg_pad12_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad12_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad120_reg_t;


