espressif/esp-idf/components/soc/esp32p4/include/soc/lp_iomux_struct.h
/** Group: pad13 */
/** Type of pad13 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad13_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad13_drv:2;
        /** reg_pad13_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad13_rde:1;
        /** reg_pad13_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad13_rue:1;
        /** reg_pad13_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad13_mux_sel:1;
        /** reg_pad13_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad13_fun_sel:2;
        /** reg_pad13_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad13_slp_sel:1;
        /** reg_pad13_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad13_slp_ie:1;
        /** reg_pad13_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad13_slp_oe:1;
        /** reg_pad13_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad13_fun_ie:1;
        /** reg_pad13_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad13_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad13_reg_t;


/** Group: pad14 */
/** Type of pad14 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad14_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad14_drv:2;
        /** reg_pad14_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad14_rde:1;
        /** reg_pad14_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad14_rue:1;
        /** reg_pad14_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad14_mux_sel:1;
        /** reg_pad14_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad14_fun_sel:2;
        /** reg_pad14_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad14_slp_sel:1;
        /** reg_pad14_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad14_slp_ie:1;
        /** reg_pad14_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad14_slp_oe:1;
        /** reg_pad14_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad14_fun_ie:1;
        /** reg_pad14_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad14_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad14_reg_t;


/** Group: pad15 */
/** Type of pad15 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pad15_drv : R/W; bitpos: [1:0]; default: 2;
         *  Reserved
         */
        uint32_t reg_pad15_drv:2;
        /** reg_pad15_rde : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad15_rde:1;
        /** reg_pad15_rue : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad15_rue:1;
        /** reg_pad15_mux_sel : R/W; bitpos: [4]; default: 0;
         *  1:use LP GPIO,0: use digital GPIO
         */
        uint32_t reg_pad15_mux_sel:1;
        /** reg_pad15_fun_sel : R/W; bitpos: [6:5]; default: 0;
         *  function sel
         */
        uint32_t reg_pad15_fun_sel:2;
        /** reg_pad15_slp_sel : R/W; bitpos: [7]; default: 0;
         *  1: enable sleep mode during sleep,0: no sleep mode
         */
        uint32_t reg_pad15_slp_sel:1;
        /** reg_pad15_slp_ie : R/W; bitpos: [8]; default: 0;
         *  input enable in sleep mode
         */
        uint32_t reg_pad15_slp_ie:1;
        /** reg_pad15_slp_oe : R/W; bitpos: [9]; default: 0;
         *  output enable in sleep mode
         */
        uint32_t reg_pad15_slp_oe:1;
        /** reg_pad15_fun_ie : R/W; bitpos: [10]; default: 0;
         *  input enable in work mode
         */
        uint32_t reg_pad15_fun_ie:1;
        /** reg_pad15_filter_en : R/W; bitpos: [11]; default: 0;
         *  need des
         */
        uint32_t reg_pad15_filter_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_iomux_pad15_reg_t;


/** Group: ext_wakeup0_sel */
/** Type of ext_wakeup0_sel register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_xtl_ext_ctr_sel : R/W; bitpos: [4:0]; default: 0;
         *  select LP GPIO 0 ~ 15 to control XTAL
         */
        uint32_t reg_xtl_ext_ctr_sel:5;
        /** reg_ext_wakeup0_sel : R/W; bitpos: [9:5]; default: 0;
         *  Reserved
         */
        uint32_t reg_ext_wakeup0_sel:5;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} lp_iomux_ext_wakeup0_sel_reg_t;


/** Group: lp_pad_hold */
/** Type of lp_pad_hold register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_lp_gpio_hold : R/W; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_lp_gpio_hold:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_iomux_lp_pad_hold_reg_t;


/** Group: lp_pad_hys */
/** Type of lp_pad_hys register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_lp_gpio_hys : R/W; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_lp_gpio_hys:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_iomux_lp_pad_hys_reg_t;


typedef struct {
    volatile lp_iomux_clk_en_reg_t clk_en;
    volatile lp_iomux_ver_date_reg_t ver_date;
    volatile lp_iomux_pad0_reg_t pad0;
    volatile lp_iomux_pad1_reg_t pad1;
    volatile lp_iomux_pad2_reg_t pad2;
    volatile lp_iomux_pad3_reg_t pad3;
    volatile lp_iomux_pad4_reg_t pad4;
    volatile lp_iomux_pad5_reg_t pad5;
    volatile lp_iomux_pad6_reg_t pad6;
    volatile lp_iomux_pad7_reg_t pad7;
    volatile lp_iomux_pad8_reg_t pad8;
    volatile lp_iomux_pad9_reg_t pad9;
    volatile lp_iomux_pad10_reg_t pad10;
    volatile lp_iomux_pad11_reg_t pad11;
    volatile lp_iomux_pad120_reg_t pad120;
    volatile lp_iomux_pad13_reg_t pad13;
    volatile lp_iomux_pad14_reg_t pad14;
    volatile lp_iomux_pad15_reg_t pad15;
    volatile lp_iomux_ext_wakeup0_sel_reg_t ext_wakeup0_sel;
    volatile lp_iomux_lp_pad_hold_reg_t lp_pad_hold;
    volatile lp_iomux_lp_pad_hys_reg_t lp_pad_hys;
} lp_iomux_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(lp_iomux_dev_t) == 0x54, "Invalid size of lp_iomux_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
